Repository: rampecke/ArRobot-IOS
Catalog: App/Localizable.xcstrings
Source language: en
Languages: de

source: Add instruction
de: Füge Anweisung hinzu

source: And
de: Und

# and_description
source: Checks if two expressions are true
de: Prüfe ob beide Ausdrücke stimmen

source: Challenge
de: Herrausforderung

source: Conditions
de: Bedingungen

source: Connected
de: Verbunden

source: ControlFlows
de: Kontrollfluss

source: Create
de: Erstellen

source: Create project with exercise
de: Erstelle ein Projekt mit der Aufgabe

source: Create Room
de: Erstelle neuen Raum

source: Date
de: Datum

source: Delete code
de: Code löschen

source: Delete Project
de: Projekt löschen

source: Difficulty
de: Schwierigkeit

source: Difficulty:
de: Schwierigkeit:

source: Easy
de: Einfach

# emptyExpression_error_message
source: It is not allowed to have empty conditions
de: Es ist nicht erlaubt eine leere Bedingung zu haben

# error_header
source: Execution failed
de: Ausführung fehlgeschlagen

source: Execute all
de: Alle ausführen

source: Exercise Name
de: Aufgaben Name

source: Exercise received %@
de: Aufgabe angekommen %@

source: Exercise Templates
de: Aufgaben Vorlagen

# exercise_done
source: You did it!
de: Geschafft!

# exercise_not_done
source: That was not the exercise. Try again.
de: Das war nicht die Aufgabe. Probier es nochmal.

source: Exercises
de: Aufgaben

source: Export
de: Exportieren

source: Export %@
de: Exportiere %@

source: Go back and add a new exercise template!
de: Geh zurück und erstelle ein neues Template!

source: Hard
de: Schwer

source: If
de: Wenn

# if_description
source: The robot will only execute the code, if a condition is fullfield
de: Der Roboter führt den Code nur aus, sofern die Bedingung erfüllt ist

source: Instructions
de: Anweisungen

source: IsBlock
de: IstBlock

# isBlock_description
source: Check if a block is in front
de: Prüfe ob ein Block vor uns liegt

source: IsBorder
de: IstRand

# isBorder_description
source: Check if a border is in front
de: Prüfe ob ein Rand vor uns ist

source: IsEast
de: IstOsten

# isEast_description
source: Check whether the robot is facing east
de: Prüft ob der Roboter nach Osten schaut

source: IsNorth
de: IstNorden

# isNorth_description
source: Check whether the robot is facing north
de: Prüft ob der Roboter nach Norden schaut

source: IsSouth
de: IstSüden

# isSouth_description
source: Check whether the robot is facing south
de: Prüft ob der Roboter nach Süden schaut

source: IsWest
de: IstWesten

# isWest_description
source: Check whether the robot is facing west
de: Prüft ob der Roboter nach Westen schaut

source: Join
de: Beitreten

source: Join Room
de: Tritt einem Raum bei

source: Length:
de: Länge:

source: Lift
de: Anheben

# lift_description
source: Instructs the robot to lift the stone in front of him
de: Weist den Roboter an, den vor ihm liegenden Stein aufzuheben

# lift_error_message
source: It is not possible to pick up a block here
de: Es ist nicht möglich, hier einen Block anzuheben

source: Make sure you shared the correct code
de: Stelle sicher du hast den richtigen Code geteilt

source: Medium
de: Mittel

source: Move your device to find a surface
de: Bewege dein Gerät um eine Oberfläche zu finden

source: New Exercise...
de: Neue Exercise…

source: New Project...
de: Neues Projekt…

source: Next step
de: Nächster Schritt

source: No participants joined yet!
de: Keine Teilnehmer beigetreten bisher!

source: Not
de: Nicht

# not_description
source: Oposite of expression
de: Gegeteil des Ausdrucks

source: Or
de: Oder

# or_description
source: Checks if one of two expressions is true
de: Prüft ob mindestens einer der beiden Ausdrücke stimmt

source: Participants
de: Teilnehmer

source: Place board
de: Platziere Bord

# placeGrass
source: Place Water Block
de: Plaziere Grasblock

# placeGrass_description
source: Instructs the robot to place a grass block in front of him
de: Weist den Roboter an, einen Grasblock vor ihm zu platzieren

# placeGrass_error_message
source: It is not possible to place a gras block here
de: Es ist nicht möglich, hier einen Grasblock zu platzieren

# placeStone
source: Place Stone Block
de: Platziere Steinblock

# placeStone_description
source: Instructs the robot to place a stone block in front of him
de: Weist den Roboter an, einen Steinblock vor ihm zu platzieren

# placeStone_error_message
source: It is not possible to place a stone block here
de: Es ist nicht möglich, hier einen Steinblock zu platzieren

# placeWater
source: Place Water Block
de: Platziere Wasserblock

# placeWater_description
source: Instructs the robot to place a water block in front of him
de: Weist den Roboter an, einen Wasserblock vor ihm zu platzieren

# placeWater_error_message
source: It is not possible to place a water block here
de: Es ist nicht möglich, hier einen Wasserblock zu platzieren

source: Project Name
de: Projekt Name

source: Projects
de: Projekte

source: Reset game
de: Spiel zurücksetzen

source: Room
de: Raum

source: Room Code
de: Raum Nummer

source: Room Info
de: Raum Info

# Room was created: %@ and has %lld
source: Room was created: %1$@ and has %2$lld
de: Raum wurde erstellt: %1$@ und hat %2$lld

source: RoomCode: %@
de: Raum Code: %@

source: Save
de: Speichern

source: Score
de: Punkte

source: Sorting
de: Sortieren

source: Speed
de: Tempo

source: Step
de: Schritt

# step_description
source: Instructs the robot to advance one step in the direction it is currently facing
de: Weist den Roboter an, einen Schritt in die Richtung zu gehen, in die er gerade blickt

# step_error_message
source: It is not possible to make a step here
de: Es ist nicht möglich, hier einen Schritt zu machen

# successful_header
source: Successful execution
de: Ausführung erfolgreich

source: There are no exercises available!
de: Keine Aufgaben verfügbar!

source: Turn Left
de: Drehe links

# turnLeft_description
source: Instructs the robot to rotate 90 degrees to the right
de: Weist den Roboter an, sich um 90 Grad nach rechts zu drehen

# turnLeft_error_message
source: It is not possible to turn left - Execution failed
de: Es ist nicht möglich, sich hier nach links zu drehen - Ausführung fehlgeschlagen

source: Turn Right
de: Drehe rechts

# turnRight_description
source: Instructs the robot to rotate 90 degrees to the left
de: Weist den Roboter an, sich um 90 Grad nach links zu drehen

# turnRight_error_message
source: It is not possible to turn right
de: Es ist nicht möglich, sich hier nach rechts zu drehen

source: Type
de: Art

source: Use simulator
de: Nutze Simulator

source: User Name
de: Nutzer Name

source: While
de: Solange

# while_description
source: Repeats the code as long as the condition is still met
de: Wiederholt den Code solange die Bedingung noch zutrifft

source: Width:
de: Weite:

# Worldsize: %lld x %lld
source: Worldsize: %1$lld x %2$lld
de: Dimension: %1$lld x %2$lld

source: Write down your exercise description...
de: Füge eine Aufgabenbeschreibung hinzu…
